<h2 class="title">Introducci&oacute;n</h2>
<p>
	Bienvenidos al manual de ShellScript donde aprender&aacute;s c&oacute;mo desarrollar con esta librer&iacute;a f&aacute;cil
	y r&aacute;pido.
</p>
<p>
	ShellScript es un framework de JavaScript. Bien, y &#191;qu&eacute; es un  framework&#63;. Por su definici&oacute;n, es un
	macro de trabajo el cual establece una estructura &uacute;til y reusable la cual le permite desarrollar f&aacute;cilmente
	sus  aplicaciones.  Entonces, &#191;qu&eacute;  quiere decir esto&#63;, que  ShellScript es  un  macro  de   trabajo   creado  en
	lenguaje JavaScript el cual nos permite usar m&uacute;ltiples funciones de distintas maneras y que funcione
	incansablemente de tal forma que podamos reusar siempre.
</p>
<p>
	ShellScript   tiene   m&uacute;ltiples   ventajas   a   la   hora   de   usarlo   ya   que   es   m&aacute;s   r&aacute;pido   que   otros
	framework y mas ligeros, posee muchas funciones en su c&oacute;digo y permite al usuario modificarlo a sus
	necesidades. Para utilizarlo solo necesitas descargalo de esta p&aacute;gina en la parte superior donde dice descarga o presiona segundo
	clic y en alert has clic donde dice aqui y listo. 
	Una vez descargado  creas tu p&aacute;gina web.
</p>
<p>
	Se te descargara un archivo comprimido .zip el cual debes descomprimilo y copiar la carpeta ShellScript completa al alojamiento de tu proyecto y ya.<br/>
	<cite>
		Nota: el framework esta en trincado con la carpeta por tal motivo NO DEBEN sacar el js de hay deben llamarlo directamente dentro de la carpeta,
		ejemplo:&lt;script src=&quot;tu_proyecto&#47;ShellScript&#47;ShellScript.js&quot;&gt;&lt;&#47;script&gt;
	</cite>
</p>
<p>
		ShellScript se usa de una manera similar a otros framework existentes en el mercado lo que 
	hace este manual mas corto de explicar. adem&aacute;s tambi&eacute;n posee un mini framework css3
	con Responsive, animaciones y apariencia como la de esta p&aacute;gina.<br/>
	<cite>
		Si revisa el c&oacute;digo de esta p&aacute;gina ver&aacute;s que el css es m&iacute;nino para la apariencia
		que tiene ya que todo es ShellScript.css
	</cite>
</p>
<pre>
<span class="coment1">//Uso de ShellScript</span>
<span class="shell">S</span>(<span class="privadas">function</span>(){
<span class="coment1">//code</span>
})				
</pre>
<p>
		Listo, ya tienes una noci&oacute;n de lo que es ShellScript. Ahora a trabajar&#33;
</p>
